BackwardStepIco/reactingPimpleCentralFoam/common/system/blockMeshDict.CPL10
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (1 0 -0.025)
    (26 0 -0.025)
    (0 1 -0.025)
    (1 1 -0.025)
    (26 1 -0.025)
    (0 2 -0.025)
    (1 2 -0.025)
    (26 2 -0.025)

    (1 0 0.025)
    (26 0 0.025)
    (0 1 0.025)
    (1 1 0.025)
    (26 1 0.025)
    (0 2 0.025)
    (1 2 0.025)
    (26 2 0.025)
);

blocks
(
    hex (0 1 4 3 8  9  12 11) (250 10 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) ( 10 10 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (250 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 5 13 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 4 12 9)
            (4 7 15 12)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1  9  8)
            (0 3 11  8)
            (2 3 11 10)
            (5 6 14 13)
            (6 7 15 14)
        );
    }
    symwall
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (2 3 6 5)
            (3 4 7 6)
            (8 9 12 11)
            (10 11 14 13)
            (11 12 15 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
