BackwardStepIco/reactingPimpleCentralFoam/common/system/control.include
application    reactingPimpleCentralFoam;